#+title: OA Endless Sky Mod
#+FILETAGS: :work:
*** DONE capture your thoughts on "OA Endless Sky Mod" :think:@computer:
:PROPERTIES:
:EFFORT:   8min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-27 মঙ্গল 15:07]
CLOCK: [2025-05-27 মঙ্গল 15:01]--[2025-05-27 মঙ্গল 15:07] =>  0:06
:END:
<2025-05-27 মঙ্গল 15:15-15:23>
*** DONE search for notes related to "OA Endless Sky Mod" and dump them into the "basket" :@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-27 মঙ্গল 15:12]
CLOCK: [2025-05-27 মঙ্গল 15:07]--[2025-05-27 মঙ্গল 15:12] =>  0:05
:END:
<2025-05-27 মঙ্গল 15:23-15:31>
*** DONE consolidate the basket of "OA Endless Sky Mod" into a component outline :think:@computer:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
CLOCK: [2025-05-27 মঙ্গল 15:13]--[2025-05-27 মঙ্গল 15:20] =>  0:07
:END:
<2025-05-27 মঙ্গল 15:31-15:36>

*** DONE break down the components of "OA Endless Sky Mod" into smaller ones :think:@computer:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-28 বুধ 15:18]
CLOCK: [2025-05-28 বুধ 15:13]--[2025-05-28 বুধ 15:18] =>  0:05
:END:
<2025-05-28 বুধ 14:55-15:03>
*** DONE sketch out tasks of "OA Endless Sky Mod" :flow:@computer:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-29 বৃহঃ 14:46]
CLOCK: [2025-05-29 বৃহঃ 14:32]--[2025-05-29 বৃহঃ 14:46] =>  0:14
CLOCK: [2025-05-28 বুধ 15:18]--[2025-05-28 বুধ 15:25] =>  0:07
:END:
<2025-05-29 বৃহঃ 14:30-14:36>
***** DONE ask the Forum why previous OA games failed and wait :@internet:
:PROPERTIES:
:EFFORT:   2min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-29 বৃহঃ 14:49]
CLOCK: [2025-05-29 বৃহঃ 14:47]--[2025-05-29 বৃহঃ 14:49] =>  0:02
:END:
<2025-05-29 বৃহঃ 14:36-14:38>
***** DONE look online for and take notes on why previous OA games failed :@computer:@internet:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-29 বৃহঃ 14:56]
CLOCK: [2025-05-29 বৃহঃ 14:49]--[2025-05-29 বৃহঃ 14:56] =>  0:07
:END:
<2025-05-29 বৃহঃ 14:38-14:48>
***** DONE look online for and take notes on why game development projects in general fail :@computer:@internet:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-29 বৃহঃ 15:01]
CLOCK: [2025-05-29 বৃহঃ 14:56]--[2025-05-29 বৃহঃ 15:01] =>  0:05
:END:
<2025-05-29 বৃহঃ 14:48-14:58>
***** DONE look online for and take notes on what factions there are in Orion's Arm :@computer:@internet:
:PROPERTIES:
:EFFORT:   15min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-29 বৃহঃ 15:15]
CLOCK: [2025-05-29 বৃহঃ 15:01]--[2025-05-29 বৃহঃ 15:15] =>  0:14
:END:
<2025-05-29 বৃহঃ 15:15-15:30>
***** DONE look online for and take notes on how to make mods in general :@computer:@internet:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-02 সোম 15:22]
CLOCK: [2025-06-02 সোম 15:18]--[2025-06-02 সোম 15:22] =>  0:04
:END:
<2025-06-02 সোম 15:25-15:35>
***** DONE look online for and take notes on how to make Endless Sky mods :@computer:@internet:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-05-29 বৃহঃ 15:26]
CLOCK: [2025-05-29 বৃহঃ 15:17]--[2025-05-29 বৃহঃ 15:26] =>  0:09
:END:
<2025-05-29 বৃহঃ 15:50-16:00>
**** DONE use ChatGPT to convert descriptions on the EG of 30 important star systems (the capital systems of Major Empires) to files for this mod :@computer:@internet:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-02 সোম 15:35]
CLOCK: [2025-06-02 সোম 15:23]--[2025-06-02 সোম 15:35] =>  0:12
:END:
<2025-06-02 সোম 15:45-15:50>
****** DONE feed Solsys's description into ChatGPT and generate an Endless Sky data file :@@internet:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-03 মঙ্গল 14:33]
CLOCK: [2025-06-03 মঙ্গল 14:27]--[2025-06-03 মঙ্গল 14:33] =>  0:06
:END:
<2025-06-03 মঙ্গল 14:30-14:35>
****** DONE change the sprites and orbital distances of prototype Solsys until it looks accurate in position and planets :@computer:think:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-03 মঙ্গল 14:36]
CLOCK: [2025-06-03 মঙ্গল 14:33]--[2025-06-03 মঙ্গল 14:36] =>  0:03
:END:
<2025-06-03 মঙ্গল 14:35-14:40>
****** DONE change the sprites and orbital distances of prototype Ain Soph Aur until it looks accurate in position and planets :@computer:think:
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-03 মঙ্গল 14:49]
CLOCK: [2025-06-03 মঙ্গল 14:43]--[2025-06-03 মঙ্গল 14:49] =>  0:06
:END:
<2025-06-03 মঙ্গল 14:55-15:00>
***** DONE read the Endless Sky documentation on how to make a start (fully) :@computer:@internet:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-05 বৃহঃ 14:36]
CLOCK: [2025-06-05 বৃহঃ 14:27]--[2025-06-05 বৃহঃ 14:36] =>  0:09
:END:
<2025-06-05 বৃহঃ 14:30-14:38>
****** DONE change the textures of the Solsys Planets to something good :@computer:think:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-05 বৃহঃ 14:43]
CLOCK: [2025-06-05 বৃহঃ 14:41]--[2025-06-05 বৃহঃ 14:43] =>  0:02
:END:
<2025-06-05 বৃহঃ 14:46-14:48>
****** DONE change the textures of the Resonance Planets to something good :@computer:think:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-05 বৃহঃ 14:52]
CLOCK: [2025-06-05 বৃহঃ 14:46]--[2025-06-05 বৃহঃ 14:52] =>  0:06
- State "DONE"       from "TODO"       [2025-06-05 বৃহঃ 14:45]
CLOCK: [2025-06-05 বৃহঃ 14:43]--[2025-06-05 বৃহঃ 14:45] =>  0:02
:END:
<2025-06-05 বৃহঃ 14:48-14:50>
****** DONE change the textures of the Ain Soph Aur Planets to something good :@computer:think:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-05 বৃহঃ 14:56]
CLOCK: [2025-06-05 বৃহঃ 14:52]--[2025-06-05 বৃহঃ 14:56] =>  0:04
:END:
******* DONE create objects for Hightower :@computer:think:
:PROPERTIES:
:EFFORT:   10min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-09 Mon 12:38]
CLOCK: [2025-06-09 Mon 12:31]--[2025-06-09 Mon 12:38] =>  0:07
:END:
******* DONE create templates for Umma Capital
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-09 Mon 12:12]
CLOCK: [2025-06-09 Mon 12:03]--[2025-06-09 Mon 12:12] =>  0:09
:END:
******* DONE create templates for Enremdea
:PROPERTIES:
:EFFORT:   5min
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2025-06-10 Tue 08:18]
CLOCK: [2025-06-10 Tue 08:07]--[2025-06-10 Tue 08:18] =>  0:11
CLOCK: [2025-06-09 Mon 20:29]--[2025-06-09 Mon 20:30] =>  0:01
:END:
***** TODO look online for and take notes on how to sign in to Github :@computer:think:
:PROPERTIES:
:EFFORT:   3min
:END:
:LOGBOOK:
CLOCK: [2025-06-01 রবি 07:56]--[2025-06-01 রবি 08:12] =>  0:16
:END:
